using System;
using System.Collections.Generic;

namespace ConsoleApp1
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //            На първия ред ще получите число n.На следващите n реда ще ви бъде дадена информация за растенията, които сте открили във формат: "{plant}<->{rarity}".Съхранявайте тази информация, защото ще ви е необходима по - късно.Ако получите растение повече от веднъж, актуализирайте неговата рядкост.
            // След това, докато не получите командата "Изложба", ще ви бъдат дадени някои от тези команди:
            //• „Оценка: { растение} - { рейтинг}“ – добавете дадената оценка към растението(съхранете всички оценки)
            //• „Актуализиране: { plant} - { new_rarity}“ ​​– актуализирайте рядкост на растението с новото
            //• „Нулиране: { plant}“ – премахване на всички оценки на даденото растение
            //Забележка: Ако дадено име на растението е невалидно, отпечатайте "error"
            //След командата "Изложба" отпечатайте информацията, която имате за растенията в следния формат:
            //„Растения за изложбата:
            //            - { име_на_растение1}; Рядкост: { рядкост}; Оценка: { average_rating}
            //            - { име_на_растение2}; Рядкост: { рядкост}; Оценка: { average_rating}
            //…
            //- { име_на_растениеN}; Рядкост: { рядкост}; Оценка: { average_rating}
            //            "
            //Средната оценка трябва да бъде форматирана до втория знак след десетичната запетая.
            //Вход / Ограничения
            //• Ще получите входа, както е описано по-горе
            //• JavaScript: ще получите списък с низове
            //Изход
            //• Отпечатайте информацията за всички растения, както е описано по-горе


        }
        
    }

}
