using System;

namespace _03._Karate_Strings
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //Най - прословутият човек в СофтУни – Пешо се опитва да стане майстор на карате. Бидейки програмист, Пешо няма представа как да тренира, затова решава да тренира на струни. 
            //Ударите му са отбелязани с '>'.Веднага след маркировката ще има цяло число, което означава силата на удара.
            //Трябва да премахнете x знака(където x е силата на удара), започвайки след перфоратора(">").
            //Ако намерите друг знак за удар(">"), докато изтривате знаци, трябва да добавите силата към предишния си удар.
            //Когато всички знаци се обработват, отпечатайте низа без изтритите знаци.
            //Не трябва да изтривате перфоратора – '>', но трябва да изтриете цяло число, които представляват силата. 
            //Въвеждане
            //Ще получите единична линия с низа, който се използва от Pesho за обучение.
            //Изход
            //Отпечатайте това, което е останало от низа след ударите на Пешо.
            //Ограничения
            //Винаги ще получавате сила за ударите
            //Пътят ще се състои само от букви от латинската азбука, цяло число и чара ">"
            //Силата на ударите ще бъде в интервала[0... 9]
            string field = Console.ReadLine();
            int bomb = 0;
            for (int i = 0; i < field.Length; i++)
            {
                if (bomb > 0 && field[i] != '>')
                {
                    field = field.Remove(i, 1); // Remove char on this index
                    bomb--; // One bomb is used
                    i--; // after remove next char is moved 1 position, so return counter i to this char, decreasing i by 1  
                }
                else if (field[i] == '>')
                {
                    bomb += int.Parse(field[i + 1].ToString()); // takes the digit after '>' - bomb strength and add to bomb
                }
            }
            Console.WriteLine(field);

        }
    }
}
