using System;

namespace _10._Rage_Expenses
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //Игровата му настройка се състои от слушалки, мишка, клавиатура и дисплей.Ще получите броя на загубените игри на Петър.
            //При всяка втора загубена игра Петър изхвърля слушалките си.
            //При всяка трета загубена игра Петър разбива мишката си.
            //Когато Петър изхвърля и мишката, и слушалките си в една и съща загубена игра, той изхвърля и клавиатурата си.
            //Всеки втори път, когато изхвърля клавиатурата си, той изхвърля и дисплея си.
            //Ще получите цената на всеки артикул в неговата игрална настройка. Изчислете разходите му за ярост за подновяване на игралното му оборудване.
            //Вход / Ограничения
            //• На първия входен ред -брои загубени игри – цяло число в диапазона[0, 1000].
            //• На втория ред – цена на слушалките – числото с плаваща запетая в диапазона[0, 1000].
            //• На третия ред – цена на мишката - числото с плаваща запетая в диапазона[0, 1000].
            //• На четвъртия ред – цена на клавиатурата – числото с плаваща запетая в диапазона[0, 1000].
            //• На петия ред – показване на цената – числото с плаваща запетая в диапазона[0, 1000].
            //Изход
            //• Като изход трябва да отпечатате общите разходи на Петър:
            int numLostGames=int.Parse(Console.ReadLine());
            double priceHeadset = double.Parse(Console.ReadLine());
            double priceMous = double.Parse(Console.ReadLine());
            double priceKeubord = double.Parse(Console.ReadLine());
            double priceDisplay = double.Parse (Console.ReadLine());
            double sum = 0;
            for (int i = 1; i <= numLostGames; i++)
            {


                if (i % 2 == 0)
                {
                    sum += priceHeadset;
                }
                if (i % 3 == 0)
                {
                    sum += priceMous;
                }
                if (i % 6 == 0)
                {
                    sum += priceKeubord;
                }
                if (i % 12 == 0)
                {
                    sum += priceDisplay;
                }
            }
            Console.WriteLine($"Rage expenses: {sum:f2} lv.");
        }
    }
}
